package tdh.xsyj;

import java.util.HashMap;
import java.util.Map;

public class AjlxConst {
	/**
	 * 案件类型编码和类型代码的对应关系
	 */
	public static final Map<String,String>  AJLX_DM_MAP = new HashMap<String,String>();
	
	public static final Map<String,String>  DM_AJLX_MAP = new HashMap<String,String>();
	
	/**
	 * 存入规范的交换XML_的案件类型以及5分钟的类型
	 */
	static{
		String[] wfzajlx = {"1", "2", "3", "4", "5", "6", "7", "8", "9", "10",
							"11","12","13","14","15","16","17","18","19","20",
							"21","22","23","24","25","26","27","28","29","30",
							"31","32","33","34","35","36","37","38","39","40",
							"41","42","43","44","45","46","47","48","49","50",
							"51","52","53","54","55","56","57","58","59","60",
							"61","62","63","64","65","66","67","68","69","70",
							"71","72","73","74","75","76"};
		
		String[] ajlxbm =  {"11","12","14","13","15","21","22","23","24","25",
				            "31","32","33","34","41","42","51","61","81","71",
				            "16","17","18","91","ZZ","1A","1B","1C","19","1D",
				            "1E","1F","1Z","26","27","2Z","3Z","4Z","A1","AZ",
				            "82","C1","D1","D2","D3","D4","5Z","28","29","1G",
				            "1H","1I","1J","2A","2B","2C","2D","2E","2F","B1",
				            "B2","B3","B4","B5","B6","B7","B8","B9","BA","43",
				            "44","45","46","47","48","49"}; 
		
		for(int i = 0 ; i < wfzajlx.length ; i ++) {
			AJLX_DM_MAP.put(ajlxbm[i] , wfzajlx[i]);
			DM_AJLX_MAP.put( wfzajlx[i] , ajlxbm[i]);
		}
	}
}
